# Importing dataset

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,5/2/2014 0:00,3.130000e+05,3.0,1.50,1340.0,7912.0,1.5,0.0,0.0,3,1340.0,0.0,1955.0,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,5/2/2014 0:00,2.384000e+06,5.0,2.50,3650.0,9050.0,2.0,0.0,4.0,5,3370.0,280.0,1921.0,0,709 W Blaine St,Seattle,WA 98119,USA
2,5/2/2014 0:00,3.420000e+05,3.0,2.00,1930.0,11947.0,1.0,0.0,0.0,4,1930.0,0.0,1966.0,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,5/2/2014 0:00,4.200000e+05,3.0,2.25,2000.0,8030.0,1.0,0.0,0.0,4,1000.0,1000.0,1963.0,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,5/2/2014 0:00,5.500000e+05,4.0,2.50,1940.0,10500.0,1.0,0.0,0.0,4,1140.0,800.0,1976.0,1992,9105 170th Ave NE,Redmond,WA 98052,USA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4595,7/9/2014 0:00,3.081667e+05,3.0,1.75,1510.0,6360.0,1.0,0.0,0.0,4,1510.0,0.0,1954.0,1979,501 N 143rd St,Seattle,WA 98133,USA
4596,7/9/2014 0:00,5.343333e+05,3.0,NaN,1460.0,7573.0,2.0,0.0,0.0,3,1460.0,0.0,1983.0,2009,14855 SE 10th Pl,Bellevue,WA 98007,USA
4597,7/9/2014 0:00,4.169042e+05,3.0,NaN,3010.0,7014.0,2.0,0.0,0.0,3,3010.0,0.0,2009.0,0,759 Ilwaco Pl NE,Renton,WA 98059,USA
4598,7/10/2014 0:00,2.034000e+05,4.0,2.00,2090.0,6630.0,1.0,0.0,0.0,3,1070.0,1020.0,1974.0,0,5148 S Creston St,Seattle,WA 98178,USA
4599,7/10/2014 0:00,2.206000e+05,3.0,2.50,1490.0,8102.0,2.0,0.0,0.0,4,1490.0,0.0,1990.0,0,18717 SE 258th St,Covington,WA 98042,USA

# Data Pre-Process

In [2]:
print("Total null values in each column:")
print(df.isnull().sum())

Total null values in each column:
date             0
price            3
bedrooms         5
bathrooms        2
sqft_living      2
sqft_lot         2
floors           2
waterfront       5
view             2
condition        0
sqft_above       3
sqft_basement    3
yr_built         6
yr_renovated     0
street           3
city             4
statezip         3
country          6
dtype: int64

In [3]:
print(f"Null values in price are : {df['price'].isnull().sum()}")

Null values in price are : 3

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4597 non-null   float64
 2   bedrooms       4595 non-null   float64
 3   bathrooms      4598 non-null   float64
 4   sqft_living    4598 non-null   float64
 5   sqft_lot       4598 non-null   float64
 6   floors         4598 non-null   float64
 7   waterfront     4595 non-null   float64
 8   view           4598 non-null   float64
 9   condition      4600 non-null   int64
 10  sqft_above     4597 non-null   float64
 11  sqft_basement  4597 non-null   float64
 12  yr_built       4594 non-null   float64
 13  yr_renovated   4600 non-null   int64
 14  street         4597 non-null   object
 15  city           4596 non-null   object
 16  statezip       4597 non-null   object
 17  country        4594 non-null   object
dtypes: float64(11), int64(2), object(5)
memory usage: 647.0+ KB

In [5]:
def fillnaMode(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mode()[0])
col = ['street','city','statezip','country']
fillnaMode(col)

In [6]:
print("Total null values in each column:")
print(df.isnull().sum())

Total null values in each column:
date             0
price            3
bedrooms         5
bathrooms        2
sqft_living      2
sqft_lot         2
floors           2
waterfront       5
view             2
condition        0
sqft_above       3
sqft_basement    3
yr_built         6
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

In [7]:
def fillnaMode(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mode()[0])

columns = ['street', 'city', 'statezip', 'country']
fillnaMode(columns)

In [8]:
def fillnaMean(col):
    for i in col:
        df[i] = df[i].fillna(df[i].mean())
columns =[
    'price','bedrooms','bathrooms','sqft_living','sqft_lot',
    'floors','waterfront','view','sqft_above','sqft_basement',
    'yr_built']
fillnaMean(columns)

In [9]:
print("Total null values:")
print(df.isnull().sum())

Total null values:
date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

In [10]:
def changetoint64(col):
    for i in col:
        df[i] = df[i].astype('int64')
columns = [
    'price','bedrooms','bathrooms','sqft_living','sqft_lot',
    'floors','waterfront','view','sqft_above','sqft_basement',
    'yr_built'
]
changetoint64(columns)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           4600 non-null   object
 1   price          4600 non-null   int64
 2   bedrooms       4600 non-null   int64
 3   bathrooms      4600 non-null   int64
 4   sqft_living    4600 non-null   int64
 5   sqft_lot       4600 non-null   int64
 6   floors         4600 non-null   int64
 7   waterfront     4600 non-null   int64
 8   view           4600 non-null   int64
 9   condition      4600 non-null   int64
 10  sqft_above     4600 non-null   int64
 11  sqft_basement  4600 non-null   int64
 12  yr_built       4600 non-null   int64
 13  yr_renovated   4600 non-null   int64
 14  street         4600 non-null   object
 15  city           4600 non-null   object
 16  statezip       4600 non-null   object
 17  country        4600 non-null   object
dtypes: int64(13), object(5)
memory usage: 647.0+ KB

In [12]:
df.drop('date',axis = 1,inplace = True)
df.drop('country',axis = 1,inplace = True)

In [13]:
import numpy as np
from sklearn.preprocessing import LabelEncoder

In [14]:
df_encoded = df.copy()

In [15]:
def encodecols(col):
    for i in col:
        data = pd.DataFrame({i:df[i].unique()})
        label = LabelEncoder()
        label.fit(np.ravel(data))
        df_encoded[i] = label.transform(df[i])
col = ['street','city','statezip']
encodecols(col)

In [16]:
def to_int64_encoded(col):
    for i in col:
        df_encoded[i] = df_encoded[i].astype('int64')
col = ['street','city','statezip']
to_int64_encoded(col)

In [17]:
df_encoded.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 16 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4600 non-null   int64
 1   bedrooms       4600 non-null   int64
 2   bathrooms      4600 non-null   int64
 3   sqft_living    4600 non-null   int64
 4   sqft_lot       4600 non-null   int64
 5   floors         4600 non-null   int64
 6   waterfront     4600 non-null   int64
 7   view           4600 non-null   int64
 8   condition      4600 non-null   int64
 9   sqft_above     4600 non-null   int64
 10  sqft_basement  4600 non-null   int64
 11  yr_built       4600 non-null   int64
 12  yr_renovated   4600 non-null   int64
 13  street         4600 non-null   int64
 14  city           4600 non-null   int64
 15  statezip       4600 non-null   int64
dtypes: int64(16)
memory usage: 575.1 KB

# Train_Test

In [18]:
from sklearn.model_selection import train_test_split

In [19]:
traindata , testdata = train_test_split(df_encoded,test_size = 0.2)

In [20]:
train_x = traindata.iloc[:,1:]
train_x.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip
1001,5,3,3200,43560,2,0,0,3,3200,0,1989,0,1484,32,37
3102,5,2,2130,4180,1,0,0,5,1270,860,1926,0,2715,35,55
4538,3,1,2000,7560,1,0,0,4,1300,700,1968,0,569,32,36
3701,3,2,2050,13303,1,0,0,3,2050,0,1993,0,2970,14,2
886,3,1,1890,3825,1,0,0,3,1290,600,1974,0,3973,35,56

In [21]:
train_y = traindata.iloc[:,0]
train_y.head()

1001    499950
3102    615000
4538    325187
3701    314500
886     524950
Name: price, dtype: int64

In [22]:
test_x = testdata.iloc[:,1:]
test_x.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip
2448,3,1,1280,8184,1,0,0,4,1280,0,1947,1988,1175,36,67
366,5,3,2800,3200,1,0,0,5,1910,890,1932,2002,2947,35,52
1643,2,1,1890,5202,1,0,0,4,1890,0,1909,1989,3826,35,56
3394,4,2,2720,4613,2,0,0,3,2720,0,2005,0,4297,17,16
4246,5,5,4830,18707,2,0,1,5,3930,900,1952,1998,3819,23,25

In [23]:
test_y = testdata.iloc[:,0]
test_y.head()

2448     304000
366     1307000
1643     645500
3394     594000
4246    1681000
Name: price, dtype: int64

# SVM Classifier

In [24]:
from sklearn.svm import SVR

In [25]:
model_svc = SVR()
model_svc.fit(train_x,train_y)
print(model_svc)

SVR()

In [26]:
from sklearn.metrics import accuracy_score,mean_squared_error

In [27]:
predict = model_svc.predict(test_x)

In [28]:
mse = mean_squared_error(test_y,predict)

In [29]:
print(mse)

317415865941.38617